<?php

return [

    /*
    |--------------------------------------------------------------------------
    | أسطر اللغة الخاصة بالمصادقة
    |--------------------------------------------------------------------------
    |
    | الأسطر التالية تُستخدم أثناء المصادقة لعرض رسائل مختلفة للمستخدم.
    | يمكنك تعديل هذه الأسطر بما يتناسب مع متطلبات تطبيقك.
    |
    */

    'failed' => 'بيانات الاعتماد هذه غير مطابقة لسجلاتنا.',
    'password' => 'كلمة المرور التي أدخلتها غير صحيحة.',
    'throttle' => 'عدد كبير من محاولات تسجيل الدخول. الرجاء المحاولة مرة أخرى بعد :seconds ثانية.',
    'login_invalid' => 'بيانات الدخول غير صحيحة.',
    'login_success' => 'تم تسجيل الدخول بنجاح.',
    'we_sent_verification_code_to_your_phone' => 'لقد أرسلنا رمز التحقق إلى هاتفك. يرجى التحقق من الرسائل النصية القصيرة لتفعيل حسابك.',
    'account_banned' => 'حسابك محظور.',
    'account_not_verified' => 'حسابك غير مفعل.',
    'phone_number_already_exists' => 'رقم الهاتف هذا مستخدم بالفعل.',
    'phone_number_not_exists' => 'رقم الهاتف هذا غير موجود.',
    'otp_invalid' => 'رمز التحقق غير صحيح.',
    'otp_expired' => 'رمز التحقق منتهٍ.',
    'otp_verified' => 'تم التحقق من الرمز بنجاح.',
];
