<?php

return [
    //messages.phone.invalid
    'phone' => [
        'invalid' => 'رقم الهاتف غير صحيح.',
    ],

    'listing' => [
        'not_found' => 'العقار غير موجود.',
        'create' => 'تم إنشاء العقار بنجاح.',
        'update' => 'تم تحديث العقار بنجاح.',
        'delete' => 'تم حذف العقار بنجاح.',
        'approve' => 'تمت الموافقة على العقار بنجاح.',
        'reject' => 'تم رفض العقار بنجاح.',
        'publish' => 'تم نشر العقار بنجاح.',
        'unpublish' => 'تم إلغاء نشر العقار بنجاح.',
    ],

    'permission' => [
        'error' => 'ليس لديك إذن للقيام بهذا الإجراء.',
    ]
];
