<?php

return [
    'welcome' => [
        'title' => 'مرحبا بك في سوا ستاي',
        'body' => 'نرحب بك في عائلة سوا ستاي، نتمنى لك تجربة سكن مميزة :first_name',
    ],

    'listing' => [

        'host' => [
            'approved' => [
                'title' => 'تمت الموافقة على عقارك بنجاح',
                'body' => 'مبارك! تمت الموافقة على عقارك رقم :listing_id بنجاح. يمكن للضيوف الآن حجز عقارك والاستمتاع بإقامة مميزة. نتمنى لك نجاحاً كبيراً في رحلتك مع سوا ستاي.',
            ],

            'rejected' => [
                'title' => 'تم رفض عقارك',
                'body' => 'تم رفض عقارك رقم :listing_id. يرجى التحقق من السبب وتحديث عقارك ليتم الموافقة عليه.',
            ],

            'paused' => [
                'title' => 'تم إيقاف عقارك',
                'body' => 'تم إيقاف عقارك رقم :listing_id. يرجى التحقق من السبب وتحديث عقارك ليتم الموافقة عليه.',
            ],
            'first_created' => [
                'title' => 'تم إنشاء عقارك الأول',
                'body' => 'تم إنشاء عقارك الأول بنجاح. يمكن للضيوف الآن حجز عقارك والاستمتاع بإقامة مميزة. نتمنى لك نجاحاً كبيراً في رحلتك مع سوا ستاي.',
            ],
        ],
        'admin' => [
            'created' => [
                'title' => 'تم إنشاء عقار جديد',
                'body' => 'تم إنشاء عقار جديد بواسطة :full_name. يرجى مراجعة العقار والموافقة عليه أو رفضه.',
            ],
        ],

        'booking' => [
            'host' => [
                'created' => [
                    'title' => 'لديك حجز جديد',
                    'body' => 'هناك ضيف يريد حجز عقارك رقم :listing_id للحجز رقم :booking_id. يرجى مراجعة تفاصيل الحجز والرد في أقرب وقت ممكن.',
                ]
            ],

            'employee' => [
                'created' => [
                    'title' => 'طلب حجز جديد يحتاج للمراجعة',
                    'body' => 'تم تقديم طلب حجز جديد رقم :booking_id للعقار رقم :listing_id. يرجى التواصل مع المضيف للتحقق من توفر العقار والرد على الضيف في أقرب وقت.',
                ],

            ],

            'guest' => [
                'created' => [
                    'title' => 'تم استلام طلب حجزك',
                    'body' => 'تم استلام طلب حجزك رقم :booking_id للعقار رقم :listing_id بنجاح. سيتم التحقق من توفر العقار وسنتواصل معك على الفور.',
                    'message' => 'مرحباً بك في سوا ستاي! 👋\nشكراً لاختيارك سوا ستاي لحجز إقامتك. تم استلام طلب حجزك رقم :booking_id للعقار رقم :listing_id بنجاح ✨\nسيقوم فريقنا بالتحقق من توفر العقار وسنتواصل معك على الفور.\nنحن هنا لمساعدتك في أي وقت! 🌟',
                ],
                'accepted' => [
                    'title' => 'تم قبول طلب حجزك',
                    'body' => 'تم قبول طلب حجزك رقم :booking_id للعقار رقم :listing_id بنجاح. تم التحقق من اتاحية العقار، يرجى إكمال عملية الدفع لتأكيد الحجز.',
                    'message' => 'مرحباً بك في سوا ستاي! 👋\nشكراً لاختيارك سوا ستاي لحجز إقامتك. تم قبول طلب حجزك رقم :booking_id للعقار رقم :listing_id بنجاح ✨\nتم التحقق من اتاحية العقار، يرجى إكمال عملية الدفع لتأكيد الحجز.\nيمكنك ارفاق اثبات الدفع من خلال الرابط التالي:\nhttps://www.sawastay.com/ar/bookings/:booking_id/transactions\nنحن هنا لمساعدتك في أي وقت! 🌟',
                ],
                'confirmed' => [
                    'title' => 'تم تأكيد حجزك',
                    'body' => 'تم تأكيد حجزك رقم :booking_id للعقار رقم :listing_id بنجاح. نتمنى لك إقامة سعيدة!',
                    'message' => 'مرحباً بك في سوا ستاي! 👋\nشكراً لاختيارك سوا ستاي لحجز إقامتك. تم تأكيد حجزك رقم :booking_id للعقار رقم :listing_id بنجاح ✨\nتم التحقق من عملية الدفع وتأكيد حجزك.\nنتمنى لك إقامة سعيدة! 🌟\nنحن هنا لمساعدتك في أي وقت! 🏠',
                ],
                'completed' => [
                    'title' => 'شكراً لإقامتك معنا',
                    'body' => 'شكراً لاختيارك سوا ستاي! نتمنى أن تكون قد استمتعت بإقامتك في العقار رقم :listing_id',
                    'message' => 'مرحباً :first_name! 👋\nشكراً جزيلاً لاختيارك سوا ستاي لإقامتك. نأمل أن تكون قد استمتعت بتجربتك معنا في العقار رقم :listing_id ✨\nيسعدنا دائماً خدمتك ونتطلع لرؤيتك مرة أخرى في رحلتك القادمة! 🌟\nشكراً لثقتك بنا ونتمنى أن نراك قريباً 🏠',
                ],
                'cancelled' => [
                    'title' => 'تم إلغاء حجزك',
                    'body' => 'تم إلغاء حجزك رقم :booking_id للعقار رقم :listing_id. نأمل أن نراك قريباً في رحلة أخرى.',
                    'message' => 'مرحباً :first_name! 👋\nنود إعلامك بأنه تم إلغاء حجزك رقم :booking_id للعقار رقم :listing_id ✨\nنتفهم أن الظروف قد تتغير، ونأمل أن نراك قريباً في رحلة أخرى 🌟\nفريق سوا ستاي دائماً في خدمتك! 🏠',
                ],
                'rejected' => [
                    'title' => 'تم رفض طلب حجزك',
                    'body' => 'عذراً، تم رفض طلب حجزك رقم :booking_id للعقار رقم :listing_id لعدم توفره في الوقت الحالي. نحن هنا لمساعدتك في إيجاد المكان المناسب لإقامتك.',
                    'message' => 'مرحباً :first_name! 👋\nنأسف لإبلاغك بأنه تم رفض طلب حجزك رقم :booking_id للعقار رقم :listing_id لعدم توفره في الوقت المطلوب ✨\nلدينا العديد من الخيارات والاقتراحات الأخرى التي قد تناسبك! يسعدنا مساعدتك في العثور على المكان المثالي لإقامتك 🏠\nفريقنا جاهز لتقديم المساعدة والتوصيات المناسبة لك 🌟\nنحن هنا دائماً لخدمتك! 💫',
                ],
            ],

        ],

        'listing_review' => [
            'guest' => [
                'blocked' => [
                    'title' => 'تم حظر تقييمك',
                    'body' => 'عذراً :guest_first_name، تم حظر تقييمك رقم :review_id للعقار رقم :listing_id لمخالفته معايير المجتمع لدينا. نرجو منك الالتزام بإرشادات التقييم وتجنب استخدام أي محتوى غير لائق أو مسيء.',
                ],
            ],

            'host' => [
                'blocked' => [
                    'title' => 'تم حظر تقييم ضيفك',
                    'body' => 'مرحباً :host_first_name، لا تقلق! قمنا بحظر تقييم رقم :review_id من الضيف :guest_first_name للعقار رقم :listing_id لمخالفته معايير المجتمع لدينا. نحن نحرص دائماً على حماية سمعتك وسمعة عقارك من أي محتوى غير لائق.',
                ],
                'created' => [
                    'title' => 'تم إنشاء تقييم جديد',
                    'body' => 'تم إنشاء تقييم جديد بواسطة :guest_first_name للعقار رقم :listing_id. يرجى مراجعة التقييم والموافقة عليه أو رفضه.',
                ],
            ],
        ],

        'user' => [
            'admin' => [
                'verification' => [
                    'title' => 'تم إرسال طلب تحقق الهوية',
                    'body' => 'تم إرسال طلب تحقق الهوية بواسطة :full_name. يرجى مراجعة الطلب والموافقة عليه أو رفضه.',
                ],
            ],
            'verification' => [
                'approved' => [
                    'title' => 'تمت الموافقة على تحقق توثيقك',
                    'body' => 'مرحباً :user_first_name، تمت الموافقة على تحقق توثيقك بنجاح. يمكنك الآن الاستفادة من خدماتنا المتنوعة.',
                    'message' => 'مرحباً :user_first_name، تمت الموافقة على تحقق توثيقك بنجاح. يمكنك الآن الاستفادة من خدماتنا المتنوعة.',
                ],

                'rejected' => [
                    'title' => 'تم رفض طلب التحقق من هويتك',
                    'body' => 'مرحباً :user_first_name، عذراً تم رفض طلب التحقق من هويتك. يرجى التأكد من صحة وجودة الوثائق المطلوبة وإعادة تقديم الطلب من جديد. في حال احتجت لأي مساعدة، فريق الدعم متواجد دائماً لمساعدتك.',
                    'message' => 'مرحباً :user_first_name، عذراً تم رفض طلب التحقق من هويتك. يرجى التأكد من صحة وجودة الوثائق المطلوبة وإعادة تقديم الطلب من جديد. في حال احتجت لأي مساعدة، فريق الدعم متواجد دائماً لمساعدتك.',
                ],

                'stopped' => [
                    'title' => 'تم إيقاف حسابك',
                    'body' => 'مرحباً :user_first_name، عذراً تم إيقاف حسابك. يرجى التواصل معنا لمزيد من المعلومات.',
                    'message' => 'مرحباً :user_first_name، عذراً تم إيقاف حسابك. يرجى التواصل معنا لمزيد من المعلومات.',
                ],
            ],
        ],

        'transaction' => [
            'admin' => [
                'add_transaction' => [
                    'title' => 'تم إضافة دفعة جديدة',
                    'body' => 'تم إضافة دفعة جديدة رقم :transaction_id للحجز رقم :booking_id بمبلغ :amount بواسطة :full_name.',
                ],
            ],
        ],
    ],
];
