<?php

return [
    'pets' => [
        'yes' => 'يسمح باصطحاب الحيوانات الأليفة',
        'no' => 'غير مسموح بالحيوانات الأليفة',
    ],
    'smoking' => [
        'yes' => 'مسموح بالتدخين',
        'no' => 'ممنوع التدخين',
    ],
    'parties' => [
        'yes' => 'الحفلات مسموحة',
        'no' => 'لا يُسمح بالحفلات',
    ],
    'children' => [
        'yes' => 'مناسب للأطفال',
        'no' => 'غير مناسب للأطفال',
    ],
    'shoes' => [
        'yes' => 'يجب خلع الأحذية داخل العقار',
        'no' => 'لا يُشترط خلع الأحذية',
    ],
    'extra_guests' => [
        'yes' => 'ممنوع دخول ضيوف إضافيين',
        'no' => 'يسمح بالضيوف الإضافيين',
    ],
];
