<?php

return [
    'pets' => [
        'yes' => 'يُسمح بالحيوانات الأليفة',
        'no' => 'لا يُسمح بالحيوانات الأليفة',
    ],
    'smoking' => [
        'yes' => 'يُسمح بالتدخين',
        'no' => 'لا يُسمح بالتدخين',
    ],
    'parties' => [
        'yes' => 'يُسمح بالحفلات أو الفعاليات',
        'no' => 'لا يُسمح بالحفلات أو الفعاليات',
    ],
    'children' => [
        'yes' => 'يُسمح بالأطفال',
        'no' => 'لا يُسمح بالأطفال (مثل الأطفال دون سن الثانية أو الثانية عشرة)',
    ],
    'shoes' => [
        'yes' => 'يجب خلع الأحذية داخل المنزل',
        'no' => 'لا يُشترط خلع الأحذية',
    ],
    'extra_guests' => [
        'yes' => 'لا يُسمح بضيوف إضافيين بدون إذن',
        'no' => 'يُسمح بالضيوف الإضافيين',
    ],

    'families_only' => [
        'yes' => 'يُسمح فقط بالعائلات',
        'no' => 'يُسمح بالعائلات والضيوف الإضافيين',
    ],

    'check_in_time' => 'تسجيل الدخول بعد الساعة :time',
    'check_out_time' => 'تسجيل الخروج قبل الساعة :time',

];
